[
    {
        "role":"Senior Technical Content Designer",
        "company":"Iress",
        "summary":"Technical Writer role expanded to included UI content, error messages and user journeys.",
        "range":"Dec 2022 - Jul 2024"
    },
    {
        "role":"Technical Writer",
        "company":"Iress",
        "summary":"Created and updated context-sensitive in-product and online help documentation. Audited and restructured legacy content. Documented team processes.",
        "range":"Jan 2022 - Dec 2022"
    },
    {
        "role":"Senior Technical Writer",
        "company":"Zendesk",
        "summary":"Provided documentation support to eight product managers and their teams. Created documentation plans and published content to match product release schedules.",
        "range":"May 2021 - Oct 2021"
    },
    {
        "role":"Technical Documentation Writer",
        "company":"WingArc Australia",
        "summary":"Created an English language user guide of Japanese dashboard platform (over 2000 pages). Created user guides for new retail and warehousing IoT platform offerings. Delivered product training to retail client store managers.",
        "range":"Sep 2018 - May 2021"
    },
    {
        "role":"Technical Writer",
        "company":"Inomial Pty Ltd / DGIT Systems",
        "summary":"Created an online library of all user documentation. Documents created included user, configuration, developer, reference and format guides. Authored monthly newsletters and created marketing material.",
        "range":"Nov 2013 - Sep 2018"
    },
    {
        "role":"E-commerce and social media development",
        "company":"Habadash",
        "summary":"Created and maintained web site. Authored email newsletters.",
        "range":"2009 - 2013"
    },
    {
        "role":"IT Operations Manager",
        "company":"The Salvation Army - Australia Southern Territory",
        "summary":"Developed, implemented and documented operational processes and procedures. Created user guides and tech-notes. Published monthly IT Services newsletter.",
        "range":"May 2003 - Feb 2009"
    }
]
